# -*- coding: utf-8 -*-
from xml_generator.models import *
goods = { 1: u'Говядина', 2 : u'Масло подсолнечное', 6 : u'Пшено', 7 : u'Морковь', 8 : u'Баранина',  9 : u'Яблоки', 10 : u'Картофель', 11: u'Рыба', 12 : u'Соль поваренная пищевая', 13 : u'Чай чёрный байховый', 14 : u'Мука пшеничная', 15 : u'Лук репчатый', 16 : u'Капуста белокочанная', 17 : u'Куры', 18 : u'Хлеб ржаной', 19 : u'Молоко', 21 :u'Рис', 22 : u'Крупа гречневая', 23 : u'Вермишель', 24 : u'Сахар-песок', 25 : u'Масло сливочное',  26 : u'Яйца куриные', 27 : u'Свинина',  28 : u'Хлеб пшеничный'}


for key in goods.iterkeys():
    wb = WhiteBrand(ext_id = key, name = goods[key])
    wb.save()